## Production: eks
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 9 to add, 1 to change, 0 to destroy
```
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # aws_cloudwatch_log_subscription_filter.admin_api_request will be created
  + resource "aws_cloudwatch_log_subscription_filter" "admin_api_request" {
      + destination_arn = (known after apply)
      + distribution    = "Random"
      + filter_pattern  = "Admin API request"
      + id              = (known after apply)
      + log_group_name  = "/aws/containerinsights/notification-canada-ca-production-eks-cluster/application"
      + name            = "Admin API request"
      + role_arn        = (known after apply)
    }

  # aws_cloudwatch_log_subscription_filter.blazer_logging will be created
  + resource "aws_cloudwatch_log_subscription_filter" "blazer_logging" {
      + destination_arn = (known after apply)
      + distribution    = "Random"
      + filter_pattern  = "Audit "
      + id              = (known after apply)
      + log_group_name  = "blazer"
      + name            = "Blazer logging"
      + role_arn        = (known after apply)
    }

  # aws_wafv2_web_acl.notification-canada-ca will be updated in-place
  ~ resource "aws_wafv2_web_acl" "notification-canada-ca" {
        id          = "0426a443-20b4-423d-be00-626fc7400dac"
        name        = "notification-canada-ca-waf"
        tags        = {
            "CostCenter" = "notification-canada-ca-production"
        }
        # (6 unchanged attributes hidden)


      ~ rule {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

        # (2 unchanged blocks hidden)
    }

  # module.sentinel_forwarder.data.aws_iam_policy_document.sentinel_forwarder_lambda will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "sentinel_forwarder_lambda"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "xray:GetSamplingRules",
              + "xray:GetSamplingStatisticSummaries",
              + "xray:GetSamplingTargets",
              + "xray:PutTelemetryRecords",
              + "xray:PutTraceSegments",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
    }

  # module.sentinel_forwarder.aws_cloudwatch_log_group.sentinel_forwarder_lambda will be created
  + resource "aws_cloudwatch_log_group" "sentinel_forwarder_lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/sentinel-cloud-watch-forwarder"
      + retention_in_days = 14
      + tags              = {
          + "CostCentre" = "notification-canada-ca-production"
        }
      + tags_all          = {
          + "CostCentre" = "notification-canada-ca-production"
        }
    }

  # module.sentinel_forwarder.aws_iam_policy.sentinel_forwarder_lambda will be created
  + resource "aws_iam_policy" "sentinel_forwarder_lambda" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "SentinelForwarderLambda-sentinel-cloud-watch-forwarder"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # module.sentinel_forwarder.aws_iam_role.sentinel_forwarder_lambda will be created
  + resource "aws_iam_role" "sentinel_forwarder_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "SentinelForwarderLambda-sentinel-cloud-watch-forwarder"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.sentinel_forwarder.aws_iam_role_policy_attachment.sentinel_forwarder_lambda will be created
  + resource "aws_iam_role_policy_attachment" "sentinel_forwarder_lambda" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "SentinelForwarderLambda-sentinel-cloud-watch-forwarder"
    }

  # module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder will be created
  + resource "aws_lambda_function" "sentinel_forwarder" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + description                    = "Lambda function to forward AWS logs to Azure Sentinel"
      + filename                       = "/tmp/sentinel_forwarder.py.zip"
      + function_name                  = "sentinel-cloud-watch-forwarder"
      + handler                        = "sentinel_forwarder.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:ca-central-1:283582579564:layer:aws-sentinel-connector-layer:20",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "liR4yJNhp6SJtCjkSwnH0xGC0q00Uxebs1Cyqv8JLDw="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "notification-canada-ca-production"
        }
      + tags_all                       = {
          + "CostCentre" = "notification-canada-ca-production"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "CUSTOMER_ID" = (sensitive)
              + "LOG_TYPE"    = "ApplicationLog"
              + "SHARED_KEY"  = (sensitive)
            }
        }

      + tracing_config {
          + mode = "Active"
        }
    }

  # module.sentinel_forwarder.aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[0] will be created
  + resource "aws_lambda_permission" "sentinel_forwarder_cloudwatch_log_subscription" {
      + action        = "lambda:InvokeFunction"
      + function_name = "sentinel-cloud-watch-forwarder"
      + id            = (known after apply)
      + principal     = "logs.ca-central-1.amazonaws.com"
      + source_arn    = "arn:aws:logs:ca-central-1:296255494825:log-group:/aws/containerinsights/notification-canada-ca-production-eks-cluster/application:*"
      + statement_id  = "AllowExecutionFromCloudWatchLogs-sentinel-cloud-watch-forwarder-0"
    }

  # module.sentinel_forwarder.aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[1] will be created
  + resource "aws_lambda_permission" "sentinel_forwarder_cloudwatch_log_subscription" {
      + action        = "lambda:InvokeFunction"
      + function_name = "sentinel-cloud-watch-forwarder"
      + id            = (known after apply)
      + principal     = "logs.ca-central-1.amazonaws.com"
      + source_arn    = "arn:aws:logs:ca-central-1:296255494825:log-group:blazer:*"
      + statement_id  = "AllowExecutionFromCloudWatchLogs-sentinel-cloud-watch-forwarder-1"
    }

Plan: 9 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-cpu-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-memory-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-pods-high-cpu-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-pods-high-memory-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.celery-pods-high-cpu-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.celery-pods-high-memory-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.celery-sms-pods-high-cpu-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.celery-sms-pods-high-memory-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ddos-detected-load-balancer-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.document-download-api-high-request-count-warning"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
